{
	"attacks":
	[
		{
			"id": 0,
			"category": 0,
			"name": "Denial of Service (DoS)",
			"description": "Qualcuno sta sovraccaricando la nostra rete! Sta arrivando una grande quantità di richieste di connessione e i nostri server faticano a gestirle. Anche gli utenti trovano difficoltà a connettersi e le transazioni sono diminuite drasticamente. Alcuni di loro potrebbero addirittura non utilizzare più il nostro servizio.",
			"moneyLoss": 0,
			"usersLoss": 0,
			"moneyMalus": 0.4,
			"usersMalus": 0.8,
			"reputationMalus": 0.03,
			"maxTime": 30,
			"duration": 7
		},
		{
			"id": 1,
			"category": 0,
			"name": "Man-In-The-Middle (MITM)",
			"description": "Qualcuno è riuscito ad entrare nel nostro sistema! Si è spacciato per un dipendente in smart working a cui ha rubato le credenziali di accesso e ha provocato ingenti danni economici.",
			"moneyLoss": 100,
			"usersLoss": 0,
			"moneyMalus": 0,
			"usersMalus": 0,
			"reputationMalus": 0.04,
			"maxTime": 40,
			"duration": 5
		},
		{
			"id": 2,
			"category": 1,
			"name": "Brute-force",
			"description": "Qualcuno è riuscito ad entrare nel nostro sistema! Dopo molti tentativi a vuoto ha trovato la password di accesso e ha provocato ingenti danni economici.",
			"moneyLoss": 100,
			"usersLoss": 0,
			"moneyMalus": 0,
			"usersMalus": 0,
			"reputationMalus": 0.04,
			"maxTime": 40,
			"duration": 5
		},
		{
			"id": 3,
			"category": 1,
			"name": "Dictionary attack",
			"description": "Qualcuno è riuscito ad entrare nel nostro sistema! Ha utilizzato qualche programma basato sui dizionari di password e dopo milioni di tentativi è riuscito ad individuare quella corretta. Ha provocato ingenti danni economici.",
			"moneyLoss": 300,
			"usersLoss": 0,
			"moneyMalus": 0,
			"usersMalus": 0,
			"reputationMalus": 0.05,
			"maxTime": 50,
			"duration": 5
		},
		{
			"id": 4,
			"category": 1,
			"name": "Rainbow table attack",
			"description": "Qualcuno è riuscito ad entrare nel nostro sistema! Ha utilizzato sicuramente una rainbow table contenente milioni di password e hash per individuare una password corrispondente a una di quelle precedentemente intercettate. Ha provocato ingenti danni economici.",
			"moneyLoss": 500,
			"usersLoss": 0,
			"moneyMalus": 0,
			"usersMalus": 0,
			"reputationMalus": 0.05,
			"maxTime": 70,
			"duration": 5
		},
		{
			"id": 5,
			"category": 1,
			"name": "API vulnerability",
			"description": "Qualcuno è riuscito ad entrare nel nostro sistema! Ha sfruttato un bug presente nelle API di autenticazione per ottenere informazioni riservate di diversi utenti. Purtroppo verremo sanzionati per questo e la nostra reputazione ne risentirà.",
			"moneyLoss": 300,
			"usersLoss": 0,
			"moneyMalus": 0,
			"usersMalus": 0,
			"reputationMalus": 0.1,
			"maxTime": 40,
			"duration": 5
		},
		{
			"id": 6,
			"category": 4,
			"name": "Social engineering",
			"description": "Qualcuno è riuscito ad entrare nel nostro sistema! Un utente è stato ingannato da una mail malevola e ha condiviso le sue credenziali di accesso con il malintenzionato. La nostra compagnia non è responsabile per questo incidente, ma episodi come questo portano i clienti meno attenti a diffidare dei nostri servizi online, considerandoli poco sicuri.",
			"moneyLoss": 0,
			"usersLoss": 0.1,
			"moneyMalus": 0,
			"usersMalus": 0,
			"reputationMalus": 0.03,
			"maxTime": 50,
			"duration": 5
		},
		{
			"id": 7,
			"category": 3,
			"name": "Phishing",
			"description": "Si è verificato un data breach! I malintenzionati hanno raggirato un nostro dipendente tramite tecniche di social engineering e mail contraffatte e hanno ottenuto accesso al sistema, appropriandosi dei dati personali dei clienti e provocando all'azienda un danno economico e di immagine.",
			"moneyLoss": 500,
			"usersLoss": 0,
			"moneyMalus": 0,
			"usersMalus": 0,
			"reputationMalus": 0.1,
			"maxTime": 60,
			"duration": 5
		},
		{
			"id": 8,
			"category": 2,
			"name": "Infezione di worm",
			"description": "Il sistema è infetto! Abbiamo individuato un worm che prolifera nei nostri sistemi e sta rallentando i server e gli utenti hanno difficoltà ad effettuare le transazioni. Questo inconveniente avrà conseguenze economiche e alcuni utenti potrebbero abbandonare il servizio.",
			"moneyLoss": 0,
			"usersLoss": 0,
			"moneyMalus": 0.3,
			"usersMalus": 0.7,
			"reputationMalus": 0.03,
			"maxTime": 30,
			"duration": 7
		},
		{
			"id": 9,
			"category": 2,
			"name": "Infezione di virus",
			"description": "Il sistema è infetto! Abbiamo individuato un virus che sta danneggiando il sistema. Speriamo di poter eradicare il virus e ripristinare velocemente il sistema. Ogni secondo di mancato servizio costerà parecchio.",
			"moneyLoss": 0,
			"usersLoss": 0,
			"moneyMalus": 0.7,
			"usersMalus": 0,
			"reputationMalus": 0.05,
			"maxTime": 40,
			"duration": 7
		},
		{
			"id": 10,
			"category": 2,
			"name": "Infezione di spyware",
			"description": "Il sistema è infetto! Si tratta sicuramente di spionaggio industriale messo in atto da un'azienda rivale. Alcuni utenti ci abbandoneranno ora che possono ottenere servizi migliori da chi si è appropriato del nostro lavoro.",
			"moneyLoss": 0,
			"usersLoss": 0.2,
			"moneyMalus": 0,
			"usersMalus": 2,
			"reputationMalus": 0,
			"maxTime": 60,
			"duration": 7
		},
		{
			"id": 11,
			"category": 3,
			"name": "Infezione di ransomware",
			"description": "Il sistema è infetto! Un ransomware ha reso inaccessibili tutti i nostri dati. Dovremo ripristinare completamente il sistema. Speriamo che l'ultimo back-up sia recente, altrimenti i danni economici saranno gravi.",
			"moneyLoss": 0,
			"usersLoss": 0,
			"moneyMalus": 1,
			"usersMalus": 1,
			"reputationMalus": 0.1,
			"maxTime": 80,
			"duration": 7
		}
	]
}
