{
  "entries": [
    {
      "id": 1,
      "entryName": "DOS",
      "entryText": "Un attacco DoS (Denial of Service) ha come obiettivo l'interruzione di un servizio online. Il meccanismo alla base dell'attacco è quello di inondare la vittima con un'enorme quantità di richieste superflue, in modo che le richieste legittime impieghino molto più tempo per essere prese in carico. Nei casi più estremi questo porta all'impossibilità, seppur temporanea, di comunicare in alcun modo con la vittima.\nI DDoS (distributed DoS) sono attacchi DoS \"potenziati\" che sfruttano reti chiamate Botnet per sferrare attacchi più potenti. Una Botnet è composta da nodi (chiamati daemon, zombie o anche malbot) che sono macchine infette contenenti il software necessario a sferrare l'attacco. Questi vengono controllati in maniera remota da uno o più nodi master, che si occupano di coordinare le azioni all'interno della Botnet (questa infrastruttura è definita Command&Control). Gli effetti di un \"semplice\" attacco DoS in questo scenario vengono moltiplicati. Una tecnica aggiuntiva per aumentare ulteriormente la potenza dell'attacco è utilizzare un reflector sfruttando il suo fattore di amplificazione. I reflector sono dispositivi connessi alla rete che, se propriamente manipolati, permettono di aumentare in modo considerevole il numero di richieste inviate alla vittima.\nCi sono diverse tecniche per realizzare un DoS e le più note sono:\n1. ping flood:utilizza il protocollo di servizio ICMP. L'attaccante invia un flusso continuo di richieste di tipo ping (ICMP Echo Request) alla vittima, che viene così inondato di messaggi superflui.\n2. smurf attack: è un'evoluzione dell'attacco precedente. All'interno di una rete è possibile comunicare con tutti gli host connessi tramite un indirizzo speciale (chiamato indirizzo di broadcast). L'attaccante si spaccia per un altro host e invia a tutti una richiesta con il protocollo ICMP tramite questo indirizzo. A questo punto tutti gli host rispondono alla richiesta inviando una risposta. Le risposte confluiscono tutte verso la vittima che si ritrova inondata di messaggi superflui.\n3. SYN attack: è simile al ping flood, ma in questo caso viene utilizzato il protocollo TCP. Questo protocollo, tra le altre cose, permette di stabilire delle connessioni tra due host con un sistema di richiesta e risposta (chiamato SYN). L'attaccante inonda di richieste SYN la vittima e ignora le risposte inviate da quest'ultima. Così facendo tutte le richieste di connessione si trovano in un \"limbo\", in cui non sono più delle connessioni chiuse, ma neanche delle connessioni aperte a tutti gli effetti. Per questo motivo la vittima rimane in attesa di una conferma da parte dell'attaccante, che permetterebbe di aprire definitivamente le connessioni, ma quest'ultimo non invia nessuna risposta. Presto tutte le risorse della vittima vengono impiegate per tenere traccia delle richieste in attesa e le nuove richieste (legittime) ricevute non possono essere considerate.\nNon esistono contromisure che eliminano la possibilità di subire un attacco DoS, ma esistono precauzioni da adottare per mitigare gli effetti di un eventuale attacco:\n1. configurare correttamente i dispositivi di rete: tutte le tecniche finora descritte si basano su errori di configurazione. Ad esempio per impedire uno smurf attack e sufficiente che i dispositivi di rete scartino richieste inviate all'indirizzo di broadcast.\n2. monitorare il traffico: tutte le tecniche di DoS sono caratterizzate dall'utilizzo inusuale di protocolli progettati per altri scopi. Monitorare costantemente il traffico permette di accorgersi più velocemente se il sistema è bersaglio di attacchi DoS.\n3. sovradimensionare il sistema: se il sistema possiede risorse maggiori di quelle necessarie al normale svolgimento dei propri servizi può reggere più a lungo ad un tentativo di DoS, dando la possibilità a chi gestisce il sistema di accorgersi per tempo dell'attacco e reagire di conseguenza.\n4. utilizzare un firewall: un firewall è molto utile per filtrare le richieste e scartare quelle considerate fasulle.",
      "link": "https://it.wikipedia.org/wiki/DOS"
    },
    {
      "id": 2,
      "entryName": "MITM",
      "entryText": "Un attacco MITM (Man In The Middle) ha come obiettivo la manipolazione di una comunicazione tra due parti per acquisire o modificare le informazioni scambiate. Il nome dell'attacco indica in senso figurato la tecnica utilizzata: l'attaccante si intrufola nello scambio di informazioni tra le due parti e impersona la controparte per entrambi.  Le contromisure da adottare sono:\n1. message authentication: allegare al messaggio una prova della sua autenticità (per esempio utilizzare certificati digitali).\n2. message integrity: effettuare dei controlli di integrità per individuare non solo la modifica, ma anche la cancellazione o la duplicazione dei messaggi (per esempio grazie all'utilizzo di hash, nonce, ...).\n3. message confidentiality: rendere i messaggi incomprensibili a tutti tranne che al destinatario (per esempio criptare il contenuto con una chiave concordata in precedenza tra le due parti).",
      "link": "https://it.wikipedia.org/wiki/Attacco_man_in_the_middle"
    },
    {
      "id": 3,
      "entryName": "Brute-force",
      "entryText": "Un attacco brute-force consiste nell'applicare la \"forza bruta\" per vagliare tutte le possibilità in un tempo ragionevole e decifrare un segreto. Si tratta di una tecnica molto semplice e rozza che sfrutta le enormi capacità dei computer moderni per rompere le password e le chiavi crittografiche non adeguatamente protette.\nLe chiavi crittografiche sono ritenute immuni a questo attacco se possiedono una lunghezza di almeno 128 bit, mentre le caratteristiche delle password ritenute sicure sono:\n1. lunghezza adeguata: se una password è lunga abbastanza (generalmente dagli 8 caratteri in poi) sarà molto complicato per un malintenzionato provare tutte le possibili combinazioni in un tempo ragionevole\n2. sufficiente complessità: se una password contiene una grande varietà di caratteri saranno necessarie molte più combinazioni a chi sta cercando di attuare un attacco brute-force (un esempio è utilizzare anche caratteri speciali oltre a numeri e lettere).",
      "link": "https://it.wikipedia.org/wiki/Metodo_forza_bruta"
    },
    {
      "id": 4,
      "entryName": "Dictionary attack",
      "entryText": "Un dictionary attack ha l'obiettivo di individuare una password dato il valore del suo hash. A differenza del brute-force attack, che considera ogni possibile password, in questo attacco vengono considerate solo alcuni tipi di password, che risultano essere le più utilizzate (ad esempio password semplici da ricordare come \"12345678\", parole di senso compiuto come \"password\", date di nascita come \"12051977\", ma anche varie combinazioni come \"simone86\"). Prima di mettere in atto l'attacco vero e proprio è necessario calcolare gli hash delle password considerate. Al termine di questa lunga operazione l'attaccante inizia a confrontare un valore di hash intercettato durante l'autenticazione di un utente con i valori da lui calcolati. Se risulta una corrispondenza l'attaccante può utilizzare la password corrispondente per superare l'autenticazione, spacciandosi per l'utente di cui ha intercettato l'hash.\nPer contrastare questo tipo di attacchi è buona abitudine che l'utente eviti di impostare password di senso comune (come quelle mostrate sopra).",
      "link": "https://it.wikipedia.org/wiki/Attacco_a_dizionario"
    },
    {
      "id": 5,
      "entryName": "Rainbow table",
      "entryText": "Un rainbow table attack ha l'obiettivo di individuare una password dato il valore del suo hash. La tecnica è un potenziamento del dictionary attack e mira ad estendere ulteriormente le dimensioni di un dizionario senza impiegare la memoria che sarebbe necessaria a memorizzare quantità di dati così voluminose. In maniera analoga alla preparazione di un dictionary attack viene precalcolato un vasto sottoinsieme di hash, ma con una variazione. Avvalendosi di una funzione di riduzione è possibile calcolare un valore a partire da un hash (il valore calcolato non corrisponde alla password originale). Quindi al valore di hash calcolato vengono applicate in sequenza una riduzione e un calcolo di hash sul risultato della riduzione. Si ripete questa operazione un numero variabile di volte fino ad ottenere una catena di riduzioni alternate a calcoli di hash. Viene memorizzato solamente l'ultimo hash della catena. Terminata questa lunga operazione è possibile per l'attaccante confrontare gli hash calcolati a partire da quello intercettato durante l'autenticazione di un utente con quelli precalcolati. Se uno di questi corrisponde è necessario ricalcolare la catena corrispondente per individuare la password utilizzata.\nUna contromisura efficace consiste nel combinare la password dell'utente con una chiave generata casualmente mantenuta segreta (chiamata salt) e poi applicare l'hash, in modo che non ci sia una relazione diretta tra la password e l'hash generato. Inoltre in questo modo per utenti con la stessa password verranno generati hash differenti.",
      "link": "https://it.wikipedia.org/wiki/Tabella_arcobaleno"
    },
    {
      "id": 6,
      "entryName": "API vulnerability",
      "entryText": "Le API vulnerability sono, appunto, vulnerabilità presenti nel codice delle API. Sfruttando queste vulnerabilità è possibile ottenere accesso al sistema oppure recuperare i dati personali degli utenti che le utilizzano. In particolare nell'ambito bancario ci sono prassi da rispettare per limitare questi rischi:\n1. testare periodicamente il codice delle API\n2. riparare frequentemente con patch eventuali vulnerabilità individuate\n3. evitare di esporre nell'URL dati personali dell'utente, in modo che non possano rimanere memorizzati nella cronologia del browser.",
      "link": "https://en.wikipedia.org/wiki/Web_API_security"
    },
    {
      "id": 7,
      "entryName": "Social engineering",
      "entryText": "Il social engineering ha l'obiettivo di spingere, involontariamente e a sua insaputa, un utente (o la vittima stessa) a partecipare ad un attacco, sfruttando i meccanismi comportamentali dell'essere umano. Spesso il malintenzionato svolge una fase preliminare di raccolta dati in modo da trarre l'utente in inganno con informazioni mirate e conquistarne la fiducia. Spesso il successo dell'attacco è dovuto dalla scarsa consapevolezza in materia di sicurezza informatica da parte delle vittime. Per realizzare con successo un attacco di questo tipo si seguono alcune regole:\n1. autorità: spesso l'attaccante si pone come un'autorità pubblica (per esempio la polizia) o privata (per esempio il capo di un'organizzazione)\n2. intimidazione: è una prassi diffusa accompagnare le richieste con minacce più o meno velate (per esempio se l'attaccante finge di avere un ruolo nell'ambiente lavorativo della vittima, la minaccia può essere che in caso di scarsa collaborazione l'accaduto verrà riferito al superiore della vittima)\n3. consenso: si tratta di sfruttare la tendenza umana di conformare il proprio comportamento a quello tenuto dagli altri\n4. scarsità: è una tecnica di marketing che si basa sulla domanda e l'offerta; infatti se il cliente percepisce che un bene scarseggia sarà più propenso a desiderarlo\n5. urgenza: simile alla scarsità, è la tecnica di accrescere il senso di urgenza per un'azione (per esempio comprare un oggetto) sostenendo che è possibile farlo per un breve lasso di tempo (per esempio con un'offerta a tempo)\n6. familiarità: si basa sull'empatia e l'attrazione di un individuo per ciò che gli risulta simile\nPer mitigare il problema è importante istruire il personale e gli utenti sui comportamenti corretti da tenere per evitare di \"abboccare\" alle richieste sospette e insegnare loro delle procedure standard da seguire.",
      "link": "https://it.wikipedia.org/wiki/Ingegneria_sociale"
    },
    {
      "id": 8,
      "entryName": "Phishing",
      "entryText": "Il phishing è una tecnica di social engineering che ha l'obiettivo di accedere in modo non autorizzato ai dati sensibili della vittima, senza sfruttare necessariamente le vulnerabilità di un sistema. La tecnica prende il nome dalla pratica della pesca perché la vittima viene \"presa all'amo\": l'attacco coinvolge la vittima per mezzo di una comunicazione (spesso via mail) mirata e a volte personalizzata, in modo che sia essa stessa a fornire spontaneamente i propri dati, fidandosi e credendo alle parole del malintenzionato.\nPer mitigare il problema è importante istruire gli utenti sui comportamenti corretti da tenere per evitare di \"abboccare\" alle richieste sospette e segnalare i tentativi di phishing alle autorità.",
      "link": "https://it.wikipedia.org/wiki/Phishing"
    },
    {
      "id": 9,
      "entryName": "Worm",
      "entryText": "Un worm è un malware che ha l'obiettivo di replicarsi all'interno del sistema infettato fino a saturare le sue risorse. A differenza di un virus, è in grado di replicarsi autonomamente, senza l'aiuto dell'intervento umano. Come ogni malware sfrutta le vulnerabilità presenti nel sistema per infettare una macchina. Da questa macchina infetta comincerà a scansionare e infettare gli altri computer, replicandosi ed estendendo l'infezione ad un numero sempre più ampio di computer. Se un sistema viene infettato da un worm risulta più lento del normale e anche la rete viene rallentata, a causa dei tentativi continui da parte del worm per replicarsi ed infettare altri sistemi connessi.\nCi sono alcune contromisure e precauzioni che possono prevenire le infezioni:\n1. aggiornamenti: applicare tempestivamente le patch di sicurezza al software limita le possibilità che un malware possa sfruttare una vulnerabilità nel codice per infettare il sistema\n2. firewall: l'utilizzo di firewall aiuta a bloccare i tentativi di infezione del sistema dall'esterno\n3. anti-virus: mantenere l'antivirus aggiornato e attivo permette di bloccare molti tentativi di infezione\n4. attenzione ai tentativi di phishing: trattare con attenzione i link e gli allegati nelle mail perchè potrebbero contenere malware.",
      "link": "https://it.wikipedia.org/wiki/Worm"
    },
    {
      "id": 10,
      "entryName": "Virus",
      "entryText": "Un virus è un malware che ha l'obiettivo di danneggiare il sistema ospite e propagarsi su altri sistemi anche grazie all'aiuto involontario di chi utilizza un sistema infetto. Per propagarsi da una vittima alla successiva si camuffa da componente di un software autorizzato. In questo modo l'utente ignora la sua reale natura e lo aiuta, suo malgrado, a diffondersi. Un virus può essere il veicolo di diffusione per un malware più complesso (come un ransomware), o è realizzato semplicemente per sabotare le attività della macchina infetta. Un virus è spesso più complicato da individuare rispetto ad un worm, perché può mettere in atto tecniche di camuffamento molto elaborate.\nCi sono alcune contromisure e precauzioni che possono prevenire le infezioni:\n1. aggiornamenti: applicare tempestivamente le patch di sicurezza al software limita le possibilità che un malware possa sfruttare una vulnerabilità nel codice per infettare il sistema\n2. firewall: l'utilizzo di firewall aiuta a bloccare i tentativi di infezione del sistema dall'esterno\n3. anti-virus: mantenere l'antivirus aggiornato e attivo permette di bloccare molti tentativi di infezione.",
      "link": "https://it.wikipedia.org/wiki/Virus_(informatica)"
    },
    {
      "id": 11,
      "entryName": "Spyware",
      "entryText": "Uno spyware è un malware che ha l'obiettivo di raccogliere informazioni dal sistema infetto (o da chi lo utilizza) e utilizzare i dati raccolti per nuocere alla vittima dell'attacco o a una terza parte (l'organizzazione per cui la vittima lavora). Le informazioni ricavate con uno spyware variano in base alla sua tipologia: possono essere dati personali per migliorare la pubblicità online (per mezzo di web tracker o adware) oppure possono rappresentare segreti industriali rubati da un'organizzazione rivale (per mezzo di trojan o keyloggers).\nCi sono alcune contromisure e precauzioni che possono prevenire le infezioni:\n1. aggiornamenti: applicare tempestivamente le patch di sicurezza al software limita le possibilità che un malware possa sfruttare una vulnerabilità nel codice per infettare il sistema\n2. firewall: l'utilizzo di firewall aiuta a bloccare i tentativi di infezione del sistema dall'esterno\n3. anti-virus: mantenere l'antivirus aggiornato e attivo permette di bloccare molti tentativi di infezione.",
      "link": "https://it.wikipedia.org/wiki/Spyware"
    },
    {
      "id": 12,
      "entryName": "Ransomware",
      "entryText": "Un ransomware è un malware che ha l'obiettivo di bloccare l'accesso al sistema infetto e a tutti i suoi dati in modo da poter ricattare chi utilizza il sistema. Per farlo solitamente il disco viene criptato e un messaggio indica all'utente l'importo da versare al ricattatore per riottenere l'accesso ai propri dati, anche se spesso il pagamento del riscatto non porta a nulla.\nCi sono alcune contromisure e precauzioni che possono prevenire le infezioni:\n1. aggiornamenti: applicare tempestivamente le patch di sicurezza al software limita le possibilità che un malware possa sfruttare una vulnerabilità nel codice per infettare il sistema\n2. firewall: l'utilizzo di firewall aiuta a bloccare i tentativi di infezione del sistema dall'esterno\n3. anti-virus: mantenere l'antivirus aggiornato e attivo permette di bloccare molti tentativi di infezione\n4. backup: mantenere un backup aggiornato e isolato dal sistema permette di recuperare i dati compromessi in caso di attacco.",
      "link": "https://it.wikipedia.org/wiki/Ransomware"
    },
    {
      "id": 13,
      "entryName": "Firewall",
      "entryText": "Un firewall è uno strumento che ha lo scopo di controllare il traffico in entrata e uscita di una rete. Spesso viene impiegato come barriera per monitorare il traffico tra una rete considerata affidabile (es. una rete aziendale) e un'altra rete esterna considerata inaffidabile (es. internet). Il suo scopo principale è individuare e bloccare connessioni non autorizzate o pericolose tra l'interno e l'esterno.",
      "link": "https://it.wikipedia.org/wiki/Firewall"
    },
    {
      "id": 14,
      "entryName": "DNSSEC",
      "entryText": "Il DNS (Domain Name System) è un sistema distribuito che si occupa di rendere raggiungibili le informazioni presenti su Internet, principalmente traducendo indirizzi internet (es. www.nomesito.it) in indirizzi IP comprensibili ai dispositivi di rete (es. 192.168.27.58).\nCome indica l'acronimo, DNSSEC (DNS Security Extensions) è un set di estensioni volte a rendere sicuro lo scambio di dati che avviene tramite DNS. In particolare l'adozione di queste estensioni è utile per impedire alle applicazioni di accettare dati manipolati durante l'utilizzo del sistema DNS e mitigare anche attacchi di phishing e social engineering.",
      "link": "https://it.wikipedia.org/wiki/DNSSEC"
    },
    {
      "id": 15,
      "entryName": "MFA",
      "entryText": "Questa tecnica ha lo scopo di rafforzare il processo di autenticazione in modo che diventi estremamente complesso per un malintenzionato accedere ad un sistema usando le credenziali di un utente legittimo. L'autenticazione consiste nel dichiarare la propria identità e fornire prove sufficienti a sostegno di quanto dichiarato. Queste prove possono essere di diverso tipo:\n1. qualcosa che si conosce: ad esempio una password o un PIN\n2. qualcosa che si possiede: ad esempio un token, una smartcard o uno smartphone\n3. qualcosa che si è: ad esempio la scansione di un'impronta digitale o della retina\n4. Perciò, mentre un'autenticazione semplice può avvenire con il semplice inserimento di una password corretta, un'autenticazione a 2 fattori necessita dell'inserimento della password corretta più una seconda prova aggiuntiva, per esempio la scansione dell'impronta digitale o l'inserimento di un PIN ricevuto sullo smartphone.\nQuesta procedura può risultare seccante per l'utente, che impiega più tempo per accedere al servizio, ma è molto efficace nel prevenire brute force attack e dictionary attack: se un malintenzionato riesce ad individuare la password e la inserisce dovrà appropriarsi anche di una seconda prova in possesso dell'utente per poter effettuare l'accesso, rendendo la procedura d'attacco molto più complessa (ma non impossibile).",
      "link": "https://it.wikipedia.org/wiki/Autenticazione_a_due_fattori"
    },
    {
      "id": 16,
      "entryName": "hash",
      "entryText": "Una funzione di hash è una funzione matematica che riceve una sequenza di caratteri in input e ne genera una in output, con la particolarità che è molto complesso (se non impossibile) invertire il processo. Questa caratteristica è utilizzata ad esempio per rendere illeggibili le password durante il processo di autenticazione: se un utente deve inserire una password per effettuare il login, ne viene calcolato l'hash e questo viene inviato al server (es. la password \"password1234\" viene trasformata in \"23acb9754eff\"). Il server riceve l'hash e lo confronta con quello memorizzato nel database, verificando indirettamente se la password è corretta. In questo modo non è necessario memorizzare le password in chiaro sul server, con il rischio che queste vengano compromesse da un malintenzionato.",
      "link": "https://it.wikipedia.org/wiki/Funzione_crittografica_di_hash"
    },
    {
      "id": 17,
      "entryName": "CAPTCHA",
      "entryText": "CAPTCHA (Completely Automated Public Turing test to tell Computers and Humans Apart) è un complicato acronimo per indicare un test online. L'obiettivo di questo test è capire se a fornire la risposta è stato un essere umano o una macchina. Per riuscire nel compito i test di questo tipo presentano alcune caratteristiche comuni:\n1. riconoscimento invariante: si riferisce all'abilità di riconoscere un gran numero di variazioni nelle forme delle lettere. Un essere umano ha la capacità di riconoscere una lettera anche se presenta deformazioni notevoli, mentre un computer non è in grado di adattarsi altrettanto bene\n2. segmentazione: è l'abilità di separare una lettera dall'altra. Per un computer è difficile separare lettere molto vicine tra loro\n3. contesto: si riferisce all'abilità dell'essere umano di fornire un contesto a ciò che vede, a differenza dei computer.",
      "link": "https://it.wikipedia.org/wiki/CAPTCHA"
    },
    {
      "id": 18,
      "entryName": "IDS",
      "entryText": "Un IDS è un software che monitora una rete, o più in generale un sistema, alla ricerca di tracce che indichino attività malevole. A differenza di un firewall questo sistema opera solamente nella rete interna e, come indica il nome, individua violazioni che sono già avvenute. Il suo funzionamento si basa sul principio che eventuali intrusi si comportano in modo differente rispetto agli utenti autorizzati della rete. Quindi il software IDS analizza il traffico della rete e se individua eventuali anomalie le segnala (solitamente all'amministratore di rete).",
      "link": "https://it.wikipedia.org/wiki/Intrusion_detection_system"
    },
    {
      "id": 19,
      "entryName": "Antivirus",
      "entryText": "Un antivirus è un programma che si occupa di prevenire e curare le infezioni malware (non solo virus ma anche worm, spyware, ransomware, …) sui computer. La principale attività che un antivirus svolge è monitorare e analizzare il software in esecuzione: se una parte del codice da eseguire è sospettata di far parte del codice di un malware la sua esecuzione viene bloccata e viene lanciato un allarme per informare l'amministratore dell'accaduto.",
      "link": "https://it.wikipedia.org/wiki/Antivirus"
    },
    {
      "id": 20,
      "entryName": "Backup",
      "entryText": "Il termine backup indica una copia dei dati di un sistema che hanno lo scopo di aiutare a ricostruire il sistema in caso di incidente e perdita dei dati originali. In caso di ripristino i dati più recenti che non rientrano nel backup vanno persi per sempre; per questo è importante fare in modo che tra un backup e il successivo non intercorra troppo tempo.\nNel progettare un sistema di backup viene spesso seguita la regola 3-2-1:\n1. 3 - ridondanza: si devono mantenere almeno 3 copie dei dati (1 con i dati originali e 2 con i dati di backup), per evitare di perdere i dati nel caso in cui due di queste siano danneggiate\n2. 2 - diversificazione: almeno 2 copie devono essere memorizzate su supporti di tipi differenti, per evitare che tutte le copie siano afflitte dallo stesso tipo di danni\n3. 1 - isolamento: almeno 1 copia deve trovarsi in un sito differente dalle altre, per evitare che un incidente (es. un incendio) distrugga tutte le copie\nNonostante il backup, in caso di perdita dei dati, il ripristino del sistema è sempre una procedura complessa che richiede del tempo per essere completata correttamente.",
      "link": "https://it.wikipedia.org/wiki/Backup"
    }
  ]
}