{
	"powerUps":
	[
		{
			"id": 0,
			"name": "Riduzione del tempo di connessione",
			"description": "Eliminare le connessioni non completate entro un certo limite di tempo aiuta a contrastare gli attacchi DoS. Purtroppo può capitare di scartare connessioni potenzialmente valide.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 1,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 1,
			"name": "Intrusion Detection Systems (IDS)",
			"description": "L'utilizzo di IDS permette di analizzare anomalie nel traffico e aiuta a prevenire gli attacchi DoS. Può identificare comportamenti insoliti, spesso riconducibili all'opera di malware o accessi non autorizzati.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 0,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 2,
			"name": "Coda di connessioni circolare",
			"description": "Eliminare le connessioni più vecchie non ancora chiuse per far spazio alle nuove può aiutare a contrastare gli attacchi DoS. D'altra parte questa tecnica è soggetta al rischio di eliminare connessioni legittime anche se datate.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 1,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 3,
			"name": "Firewall",
			"description": "L'adozione di un firewall ben configurato garantisce una prima linea di difesa contro gli attacchi DoS meno sofisticati e permette di scartare le connessioni a siti ritenuti poco sicuri, in modo da limitare le possibilità di contagio da malware.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 0,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 4,
			"name": "DNSSEC",
			"description": "L'adozione di DNSSEC comporta un ulteriore livello di difesa da attacchi MITM e mitiga l'efficacia degli attacchi DoS.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 0,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 5,
			"name": "Limite di password errate",
			"description": "Inserire un limite ai tentativi di autenticazione fornisce una maggiore resistenza agli attacchi di brute-force e a quelli basati sui dizionari.",
			"cost": 0,
			"moneyMalus": 0,
			"usersMalus": 1,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 6,
			"name": "Attesa dopo password errata",
			"description": "Se un utente sbaglia password deve attendere un breve lasso di tempo prima di fare un nuovo tentativo. Può spazientire gli utenti più frettolosi ma è utile a prevenire attacchi di brute-force e anche attacchi basati su dizionari.",
			"cost": 0,
			"moneyMalus": 0,
			"usersMalus": 1,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 7,
			"name": "Cambio password",
			"description": "Obbligare gli utenti a cambiare password dopo un certo periodo di tempo può essere una seccatura, ma è necessario a prevenire attacchi di brute-force.",
			"cost": 0,
			"moneyMalus": 0,
			"usersMalus": 1,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 8,
			"name": "Password complesse",
			"description": "Obbligare gli utenti ad utilizzare password complesse può essere una seccatura, ma è necessario a prevenire attacchi di brute-force e attacchi basati su dizionari.",
			"cost": 0,
			"moneyMalus": 0,
			"usersMalus": 1,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 9,
			"name": "Autenticazione a 2 fattori",
			"description": "Aggiungere un passaggio all'autenticazione può spazientire gli utenti, ma il risultato è una maggiore resistenza ad attacchi MITM, brute-force e attacchi basati su dizionari.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 1,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 10,
			"name": "Utilizzare hash",
			"description": "Utilizzare funzioni di hash per manipolare le password è una tecnica necessaria per contrastare attacchi brute-force e attacchi basati su dizionari.",
			"cost": 0,
			"moneyMalus": 0,
			"usersMalus": 1,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 11,
			"name": "Utilizzare CAPTCHA",
			"description": "Aggiungere un passaggio all'autenticazione degli utenti può essere una seccatura, ma è necessario a prevenire attacchi di brute-force e attacchi basati su dizionari.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 1,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 12,
			"name": "Aggiornamenti programmati",
			"description": "Applicare prontamente le nuove patch permette di eliminare alcune vulnerabilità dal software utilizzato, rendendo più difficile sfruttare eventuali falle del codice ai malware e ai malintenzionati che cercano di sabotare le API.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 0,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 13,
			"name": "Antivirus",
			"description": "Un antivirus può rallentare il lavoro di un dipendente, ma è un agente che contribuisce in maniera determinante alla sicurezza del sistema grazie alla capacità di individuare un gran numero di malware, prima che questi danneggino il sistema.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 0,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 14,
			"name": "Solo software autorizzato",
			"description": "Utilizzare solo software autorizzato sui computer aziendali può essere limitante per un dipendente, ma con questa misura di sicurezza si evita di introdurre nuove vulnerabilità nel sistema, contrastando l'opera dei malware.",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 0,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 15,
			"name": "Training di sicurezza",
			"description": "Istruire adeguatamente i dipendenti riguardo alle minacce alla sicurezza che devono affrontare ogni giorno è un passo fondamentale per garantire un adeguato livello di sicurezza all'interno di un'azienda. Il training insegna ai dipendenti a mettere in atto comportamenti più consapevoli, con l'obiettivo di limitare l'impatto di attacchi di phishing e per mezzo di malware.",
			"cost": 0,
			"moneyMalus": 0,
			"usersMalus": 0,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 16,
			"name": "Back-up efficiente",
			"description": "Una policy di back-up efficiente e sicura non rappresenta solo un costo da sostenere, ma si rivela una grande risorsa in caso di infezione da ransomware o compromissione del sistema",
			"cost": 0,
			"moneyMalus": 1,
			"usersMalus": 0,
			"owned": false,
			"on": false,
			"attacks": []
		},
		{
			"id": 17,
			"name": "Sensibilizzare gli utenti",
			"description": "Una campagna di sensibilizzazione sui rischi legati ai servizi online per gli utenti del servizio. Permette di ridurre il rischio che questi cadano preda di tentativi di truffa per mezzo di tecniche di social engineering.",
			"cost": 0,
			"moneyMalus": 0,
			"usersMalus": 0,
			"owned": false,
			"on": false,
			"attacks": []
		}
	]
}
